{"The Shawshank Redemption": {"main_actor": "Tim Robbins", "director": "Frank Darabont", "genre": "Drama", "plot": "It is a movie in which a wrongly convicted man finds friendship, hope, and redemption within the walls of a prison.", "most_memorable_scene": "My favorite scene of the movie was when Andy Dufresne (Tim Robbins) stands in the downpour of rain outside the prison walls, finally free after decades of wrongful imprisonment."}, "The Godfather": {"main_actor": "Marlon Brando", "director": "Francis Ford Coppola", "genre": "Crime_Drama", "plot": "It is a movie in which a mafia leader faces the challenges of running a crime family in a changing world.", "most_memorable_scene": "My favorite scene of the movie was when Michael Corleone is in the restaurant and kills all of the heads of the rival families in one swift move."}, "The Dark Knight": {"main_actor": "Christian Bale", "director": "Christopher Nolan", "genre": "Action_Thriller", "plot": "It is a movie in which the vigilante Batman battles against the criminal mastermind, the Joker.", "most_memorable_scene": "My favorite scene of the movie was when the Joker and Batman confront each other on top of a building, realizing that either one of them must die for the other to escape."}, "The Godfather: Part II": {"main_actor": "Al Pacino", "director": "Francis Ford Coppola", "genre": "Crime Drama", "plot": "It is a movie in which the early life of Vito Corleone is explored, as well as the ascension of his son Michael to power in the modern crime family.", "most_memorable_scene": "My favorite scene of the movie was when Michael Corleone (Al Pacino) silently weeps while standing in front of his father's grave."}, "12 Angry Men": {"main_actor": "Henry Fonda", "director": "Sidney Lumet", "genre": "Drama", "plot": "It is a movie in which a jury of 12 men must decide the fate of a young man accused of murder.", "most_memorable_scene": "My favorite scene of the movie was when the jurors voted 11-1 in favor of 'not guilty'."}, "Schindler's List": {"main_actor": "Liam Neeson", "director": "Steven Spielberg", "genre": "Historical Drama", "plot": "It is a movie in which the German businessman Oskar Schindler saves the lives of over a thousand Polish Jews during the Holocaust.", "most_memorable_scene": "My favorite scene of the movie was when Schindler stands in front of the Jewish workers he saved and breaks down in tears, realizing the true magnitude of what he has done."}, "The Lord of the Rings: The Return of the King": {"main_actor": "Viggo Mortensen", "director": "Peter Jackson", "genre": "Fantasy", "plot": "It is a movie in which the final part of the Lord of the Rings trilogy is concluded with the return of the King and the defeat of the Dark Lord Sauron.", "most_memorable_scene": "My favorite scene of the movie was when Aragorn leads the charge of the army of the dead to save Minas Tirith from the forces of Mordor."}, "Pulp Fiction": {"main_actor": "John Travolta", "director": "Quentin Tarantino", "genre": "Crime_Drama", "plot": "It is a movie in which a series of interrelated stories about crime, drugs, and redemption unfold in non-chronological order.", "most_memorable_scene": "My favorite scene of the movie was when Jules and Vincent are in the diner and Jules delivers a famous speech about the path of the righteous man."}, "The Lord of the Rings: The Fellowship of the Ring": {"main_actor": "Viggo Mortensen", "director": "Peter Jackson", "genre": "Fantasy", "plot": "It is a movie in which a fellowship of hobbits, elves, dwarves and humans embark on a quest to destroy the powerful One Ring and defeat the Dark Lord Sauron.", "most_memorable_scene": "My favorite scene of the movie was when the fellowship is crossing the bridge of Khazad-dûm and they share a powerful moment when they all declare, \"You shall not pass!\""}, "The Good, the Bad and the Ugly": {"main_actor": "Clint Eastwood", "director": "Sergio Leone", "genre": "Western", "plot": "It is a movie in which a gunslinger, a bounty hunter, and a bandit compete in a treasure hunt.", "most_memorable_scene": "My favorite scene of the movie was the final Mexican standoff between the three main characters."}, "Forrest Gump": {"main_actor": "Tom Hanks", "director": "Robert Zemeckis", "genre": "Drama", "plot": "It is a movie in which a slow-witted but kind-hearted man embarks on an epic journey of self-discovery and adventure.", "most_memorable_scene": "My favorite scene of the movie was when Forrest is running across America and shouts to a group of people, \"I may not be a smart man, but I know what love is!\""}, "Fight Club": {"main_actor": "Brad Pitt", "director": "David Fincher", "genre": "Drama", "plot": "It is a movie in which a depressed man finds solace in an underground fight club.", "most_memorable_scene": "My favorite scene of the movie was when Tyler Durden and the narrator share a moment together as they stand in the snow and watch the buildings blow up."}, "The Lord of the Rings: The Two Towers": {"main_actor": "Viggo Mortensen", "director": "Peter Jackson", "genre": "Fantasy", "plot": "It is a movie in which the characters of the Fellowship of the Ring continue their quest to save Middle-Earth from the dark forces of Sauron.", "most_memorable_scene": "My favorite scene of the movie was when Aragorn, Legolas, and Gimli stand atop the walls of Helm's Deep and watch the sun rise as they prepare for the battle."}, "Inception": {"main_actor": "Leonardo DiCaprio", "director": "Christopher Nolan", "genre": "Thriller", "plot": "It is a movie in which a team of experts must plant an idea in the mind of a CEO by infiltrating his subconscious.", "most_memorable_scene": "My favorite scene of the movie was when Cobb is reunited with his children in the snow-covered mountain top."}, "Star Wars: Episode V - The Empire Strikes Back": {"main_actor": "Mark Hamill", "director": "Irvin Kershner", "genre": "Science fiction", "plot": "It is a movie in which the heroes of the Rebel Alliance face daunting challenges as they fight against the Galactic Empire.", "most_memorable_scene": "My favorite scene of the movie was when Luke Skywalker has his final confrontation with Darth Vader and learns the truth about his father."}, "The Matrix": {"main_actor": "Keanu Reeves", "director": "The Wachowski Brothers", "genre": "Science Fiction", "plot": "It is a movie in which a computer hacker learns about the true nature of his reality and his role in the war against its controllers.", "most_memorable_scene": "My favorite scene of the movie was when Neo sees the Matrix for the first time and he is able to dodge bullets in slow motion."}, "Goodfellas": {"main_actor": "Robert De Niro", "director": "Martin Scorsese", "genre": "Crime Drama", "plot": "It is a movie in which a young man is accepted into the world of organized crime and rises through the ranks.", "most_memorable_scene": "My favorite scene of the movie was when Henry Hill and Tommy DeVito go to the Copacabana and Henry explains to Tommy the different rules that he has to follow in order to not get noticed."}, "One Flew Over the Cuckoo's Nest": {"main_actor": "Jack Nicholson", "director": "Milos Forman", "genre": "Drama", "plot": "It is a movie in which a criminal pleads insanity to avoid prison and is sent to a mental institution where he rebels against the oppressive nurse.", "most_memorable_scene": "My favorite scene of the movie was when the protagonist, Randle McMurphy, stands up to Nurse Ratched and flips her off while the patients cheer him on."}, "Se7en": {"main_actor": "Brad Pitt", "director": "David Fincher", "genre": "Thriller", "plot": "It is a movie in which two detectives investigate a series of homicides that are inspired by the seven deadly sins.", "most_memorable_scene": "My favorite scene of the movie was when Detective Mills (Brad Pitt) finds out that the final sin, envy, was committed by his own wife."}, "Seven Samurai": {"main_actor": "Toshiro Mifune", "director": "Akira Kurosawa", "genre": "Action", "plot": "It is a movie in which seven masterless samurai join forces to protect a small village from a band of marauding bandits.", "most_memorable_scene": "My favorite scene of the movie was when the seven samurai face off against the overwhelming number of bandits as the sun sets in the background."}, "It's a Wonderful Life": {"main_actor": "Jimmy Stewart", "director": "Frank Capra", "genre": "Drama", "plot": "It is a movie in which a man is shown what life would have been like if he had never existed.", "most_memorable_scene": "My favorite scene of the movie was when George Bailey realizes that all of his friends and family have come to his aid when he was in despair."}, "The Silence of the Lambs": {"main_actor": "Jodie Foster", "director": "Jonathan Demme", "genre": "Thriller", "plot": "It is a movie in which an FBI trainee seeks the advice of an infamous serial killer to capture another serial killer.", "most_memorable_scene": "My favorite scene of the movie was when Clarice and Hannibal Lecter first meet face-to-face in his prison cell."}, "City of God": {"main_actor": "Alexandre Rodrigues", "director": "Fernando Meirelles", "genre": "Drama", "plot": "It is a movie in which two boys growing up in a violent neighborhood of Rio de Janeiro take different paths: one ends up a photographer, the other a drug dealer.", "most_memorable_scene": "My favorite scene of the movie was when Rocket and Li'l Dice are playing in the favela, and Rocket takes a picture of his friend, capturing an ephemeral moment of innocence in the chaos of the violent environment."}, "Saving Private Ryan": {"main_actor": "Tom Hanks", "director": "Steven Spielberg", "genre": "War_Film", "plot": "It is a movie in which a group of U.S. soldiers are sent on a mission to find and save a paratrooper during World War II.", "most_memorable_scene": "My favorite scene of the movie was the one where the American flag is raised on top of the cliff at the end of the battle."}, "Life Is Beautiful": {"main_actor": "Roberto Benigni", "director": "Roberto Benigni", "genre": "Comedy-Drama", "plot": "It is a movie in which a father uses his imagination to help his son survive the horrors of a Nazi concentration camp.", "most_memorable_scene": "My favorite scene of the movie was when Guido and his son, Joshua, play a game in which they pretend the concentration camp is a game, and the stakes are that Guido will get out of the camp if Joshua can get a hundred points."}, "Interstellar": {"main_actor": "Matthew McConaughey", "director": "Christopher Nolan", "genre": "Science Fiction", "plot": "It is a movie in which a team of explorers travel through a wormhole in an attempt to ensure humanity's survival.", "most_memorable_scene": "My favorite scene of the movie was when Cooper (Matthew McConaughey) used the laws of gravity to slingshot himself through a black hole to save his daughter and the rest of humanity."}, "The Green Mile": {"main_actor": "Tom Hanks", "director": "Frank Darabont", "genre": "Drama", "plot": "It is a movie in which a prison guard forms a bond with a death row inmate with supernatural abilities.", "most_memorable_scene": "My favorite scene of the movie was when John Coffey performs a miraculous healing on Paul Edgecomb's urinary infection."}, "Star Wars: Episode IV - A New Hope": {"main_actor": "Mark Hamill", "director": "George Lucas", "genre": "Sci-fi/Fantasy", "plot": "It is a movie in which a young farmhand, Luke Skywalker, joins forces with a Jedi Knight, a cocky pilot, a Wookiee and two droids to save the galaxy from the Empire's world-destroying battle-station, while also attempting to rescue Princess Leia from the evil Darth Vader.", "most_memorable_scene": "My favorite scene of the movie was when Luke Skywalker and Han Solo destroyed the Death Star and Princess Leia thanked them with a kiss."}, "Terminator 2: Judgment Day": {"main_actor": "Arnold Schwarzenegger", "director": "James Cameron", "genre": "Action_Sci-Fi", "plot": "It is a movie in which a cyborg from the future is sent back in time to protect the young son of a resistance fighter from a more advanced cyborg.", "most_memorable_scene": "My favorite scene of the movie was when Sarah Connor throws the arm and CPU of the Terminator into the steel-melting furnace."}, "Back to the Future": {"main_actor": "Michael J. Fox", "director": "Robert Zemeckis", "genre": "Science Fiction", "plot": "It is a movie in which a young man is accidentally sent back in time to the 1950s.", "most_memorable_scene": "My favorite scene of the movie was when Marty McFly plays 'Johnny B. Goode' in 1955, and the entire town dances with him."}, "Spirited Away": {"main_actor": "Miyu Irino", "director": "Hayao Miyazaki", "genre": "Anime", "plot": "It is a movie in which a young girl is spirited away to a strange and mystical world.", "most_memorable_scene": "My favorite scene of the movie was when Chihiro and Haku are flying above the Spirit World to reunite with her parents."}, "The Pianist": {"main_actor": "Adrien Brody", "director": "Roman Polanski", "genre": "Drama", "plot": "It is a movie in which a Jewish pianist struggles to survive and stay true to his music during the Nazi occupation of Poland.", "most_memorable_scene": "My favorite scene of the movie was when Wladyslaw Szpilman plays the piano for a German Officer, who is moved to tears by his performance."}, "Psycho": {"main_actor": "Anthony Perkins", "director": "Alfred Hitchcock", "genre": "Thriller", "plot": "It is a movie in which a young man's mental illness causes him to struggle with balancing his violent impulses and desire to fit in.", "most_memorable_scene": "My favorite scene of the movie was when Marion Crane is in the shower and Norman Bates is seen through the shower curtain, stabbing her with a knife."}, "Parasite": {"main_actor": "Song Kang-ho", "director": "Bong Joon-ho", "genre": "Thriller", "plot": "It is a movie in which a family's lives are disrupted by a parasitic alien life form.", "most_memorable_scene": "My favorite scene of the movie was when Kim Ki-Woo finds out that he's been tricked and he is a \"parasite\" himself."}, "Léon: The Professional": {"main_actor": "Jean Reno", "director": "Luc Besson", "genre": "Action_thriller", "plot": "It is a movie in which an orphaned 12-year-old girl befriends a professional assassin as she faces danger from corrupt police officers.", "most_memorable_scene": "My favorite scene of the movie was when Mathilda, Leon's 12-year-old neighbor, practices shooting with Leon in his apartment."}, "The Lion King": {"main_actor": "Matthew Broderick", "director": "Jon Favreau", "genre": "Animated Musical", "plot": "It is a movie in which a young lion prince struggles to take his rightful place in the animal kingdom.", "most_memorable_scene": "My favorite scene of the movie was when Simba proudly stands atop Pride Rock and roars, declaring his rightful place as the King of the Pridelands."}, "Gladiator": {"main_actor": "Russell Crowe", "director": "Ridley Scott", "genre": "Action_Adventure", "plot": "It is a movie in which a man from a humble background rises to become a great gladiator and fight for the honour of his family and his freedom.", "most_memorable_scene": "My favorite scene of the movie was when Maximus is fighting in the Colosseum and is reunited with his family in the afterlife."}, "American History X": {"main_actor": "Edward Norton", "director": "Tony Kaye", "genre": "Drama", "plot": "It is a movie in which a man tries to prevent his younger brother from going down the same path of racism and violence that he has taken.", "most_memorable_scene": "My favorite scene of the movie was when Derek confronts the neo-Nazi's in the school bathroom."}, "The Departed": {"main_actor": "Leonardo DiCaprio", "director": "Martin Scorsese", "genre": "Crime Thriller", "plot": "It is a movie in which an undercover cop and criminal both try to uncover each other's identity.", "most_memorable_scene": "My favorite scene of the movie was when Billy Costigan (Leonardo DiCaprio) and Colin Sullivan (Matt Damon) finally come face to face after months of working undercover."}, "The Usual Suspects": {"main_actor": "Kevin Spacey", "director": "Bryan Singer", "genre": "Mystery", "plot": "It is a movie in which a con artist and his four criminal cohorts are suspected of pulling off a major heist.", "most_memorable_scene": "My favorite scene of the movie was when Verbal Kint is interrogated by the police and reveals the identity of Keyser Soze."}, "The Prestige": {"main_actor": "Hugh Jackman", "director": "Christopher Nolan", "genre": "Mystery Thriller", "plot": "It is a movie in which two rival magicians engage in a deadly battle of deception and one-upmanship.", "most_memorable_scene": "My favorite scene of the movie was when the two magicians (Alfred and Robert) had their final showdown in the rain."}, "Whiplash": {"main_actor": "Miles Teller", "director": "Damien Chazelle", "genre": "Drama", "plot": "It is a movie in which a young jazz drummer strives to make it big in the music world.", "most_memorable_scene": "My favorite scene of the movie was when Andrew, played by Miles Teller, performs an extended drum solo at the end of the movie, proving to his instructor that he is capable of achieving greatness."}, "Casablanca": {"main_actor": "Humphrey Bogart", "director": "Michael Curtiz", "genre": "Romance", "plot": "It is a movie in which a cynical American ex-pat helps a former lover and her husband escape from the Nazis in Morocco.", "most_memorable_scene": "My favorite scene of the movie was when Rick and Ilsa say their goodbye at the airport."}, "Harakiri": {"main_actor": "Tatsuya Nakadai", "director": "Masaki Kobayashi", "genre": "Drama", "plot": "It is a movie in which a samurai commits seppuku, a ritual suicide, as an act of honorable protest.", "most_memorable_scene": "My favorite scene of the movie was when the warrior Hanshiro performed seppuku, a ritual suicide, to honor his fallen comrade after exacting revenge on the clan who wronged them."}, "Grave of the Fireflies": {"main_actor": "Tsutomu Tatsumi", "director": "Isao Takahata", "genre": "Drama", "plot": "It is a movie in which two siblings struggle to survive during the aftermath of the World War II firebombing of Kobe, Japan.", "most_memorable_scene": "My favorite scene of the movie was when Seita and Setsuko are walking away into the sunset, holding hands and looking over the beautiful field of fireflies."}, "The Intouchables": {"main_actor": "Omar Sy", "director": "Olivier Nakache", "genre": "Comedy", "plot": "It is a movie in which two men of different backgrounds form an unlikely bond as they help each other overcome their personal struggles.", "most_memorable_scene": "My favorite scene of the movie was when Philippe and Driss finally get to go skydiving and Philippe is so happy to be there."}, "Modern Times": {"main_actor": "Charlie Chaplin", "director": "Charlie Chaplin", "genre": "Comedy", "plot": "It is a movie in which a tramp is struggling to survive in the modern, industrialized world.", "most_memorable_scene": "My favorite scene of the movie was when the Little Tramp is stuck in the machinery of the factory and Charlie Chaplin is desperately trying to save him."}, "Once Upon a Time in the West": {"main_actor": "Henry Fonda", "director": "Sergio Leone", "genre": "Western", "plot": "It is a movie in which a mysterious gunslinger seeks revenge against a ruthless land baron for the death of his family.", "most_memorable_scene": "My favorite scene of the movie was when Harmonica and Frank face off in the final showdown."}, "Rear Window": {"main_actor": "James Stewart", "director": "Alfred Hitchcock", "genre": "Mystery", "plot": "It is a movie in which a wheelchair-bound photographer spies on his neighbours from his apartment window and becomes convinced one of them has committed murder.", "most_memorable_scene": "My favorite scene of the movie was when Jeff, the protagonist, was convinced that his neighbor had committed a murder and decided to take matters into his own hands."}, "Cinema Paradiso": {"main_actor": "Mario Verga", "director": "Giuseppe Tornatore", "genre": "Drama", "plot": "It is a movie in which a man reflects on his childhood friendship with the projectionist of a small-town movie theater.", "most_memorable_scene": "My favorite scene of the movie was when Alfredo shows Salvatore the film reel of his mother and father's wedding, and then shares the kiss he and Salvatore's father had shared onscreen."}, "Alien": {"main_actor": "Sigourney Weaver", "director": "Ridley Scott", "genre": "Science-Fiction", "plot": "It is a movie in which an alien is stranded on Earth and must find a way to return home.", "most_memorable_scene": "My favorite scene of the movie was when Ripley, in her underwear, fights the alien with a welding torch in the cargo hold of the Nostromo."}, "City Lights": {"main_actor": "Charlie Chaplin", "director": "Charlie Chaplin", "genre": "Comedy", "plot": "It is a movie in which a poor man and a blind woman find love and happiness.", "most_memorable_scene": "My favorite scene of the movie was when the tramp and the blind girl meet for the first time and he stands behind her, listening to her playing the violin."}, "Apocalypse Now": {"main_actor": "Marlon Brando", "director": "Francis Ford Coppola", "genre": "War drama", "plot": "It is a movie in which a U.S. Army officer is sent on a mission to assassinate a renegade Green Beret during the Vietnam War.", "most_memorable_scene": "My favorite scene of the movie was when Martin Sheen's character, Captain Willard, speaks the famous line, \"I love the smell of napalm in the morning.\""}, "Memento": {"main_actor": "Guy Pearce", "director": "Christopher Nolan", "genre": "Mystery", "plot": "It is a movie in which a man with short-term memory loss tries to solve a mystery.", "most_memorable_scene": "My favorite scene of the movie was when Leonard is able to remember his wife's name and how he got the tattoo of her name on his body."}, "Django Unchained": {"main_actor": "Jamie Foxx", "director": "Quentin Tarantino", "genre": "Western", "plot": "It is a movie in which a freed slave enlists the help of a German bounty hunter to help him rescue his wife from a plantation owner.", "most_memorable_scene": "My favorite scene of the movie was when Django rode off into the sunset with his wife, freeing themselves from their former oppressors."}, "Indiana Jones and the Raiders of the Lost Ark": {"main_actor": "Harrison Ford", "director": "Steven Spielberg", "genre": "Adventure", "plot": "It is a movie in which archeologist Indiana Jones embarks on a thrilling, action-packed search for the legendary Ark of the Covenant.", "most_memorable_scene": "My favorite scene of the movie was when Indiana Jones shoots the swordsman in the market."}, "WALL·E": {"main_actor": "Ben Burtt", "director": "Andrew Stanton", "genre": "Animation/Adventure/Comedy", "plot": "It is a movie in which a small robot named WALL·E embarks on a journey that will ultimately decide the fate of mankind.", "most_memorable_scene": "My favorite scene of the movie was when Wall·E and EVE dance in space under the stars."}, "The Lives of Others": {"main_actor": "Sebastian Koch", "director": "Florian Henckel von Donnersmarck", "genre": "Drama", "plot": "It is a movie in which a Stasi agent is assigned to spy on a dissident playwright and his girlfriend in East Berlin, only to find himself becoming increasingly sympathetic to their plight.", "most_memorable_scene": "My favorite scene of the movie was when the protagonist, Wiesler, visits the writer Dreyman's apartment and secretly repairs his malfunctioning typewriter."}, "Sunset Blvd.": {"main_actor": "William Holden", "director": "Billy Wilder", "genre": "Drama", "plot": "It is a movie in which an unsuccessful screenwriter becomes entangled in the life of a reclusive Hollywood star.", "most_memorable_scene": "My favorite scene of the movie was when Joe Gillis is floating in the pool looking up at Norma Desmond with the stars in the background."}, "Paths of Glory": {"main_actor": "Kirk Douglas", "director": "Stanley Kubrick", "genre": "Drama", "plot": "It is a movie in which a French commander defends his men against a doomed mission.", "most_memorable_scene": "My favorite scene of the movie was when Colonel Dax volunteers to lead a mission to take a German stronghold and succeeds despite all odds."}, "The Shining": {"main_actor": "Jack Nicholson", "director": "Stanley Kubrick", "genre": "Psychological Horror", "plot": "It is a movie in which a man descends into madness while taking care of a haunted hotel.", "most_memorable_scene": "My favorite scene of the movie was when Jack Torrance goes into the hedge maze and his son Danny is able to escape from him by telling him he's not his dad anymore."}, "The Great Dictator": {"main_actor": "Charlie Chaplin", "director": "Charlie Chaplin", "genre": "Comedy", "plot": "It is a movie in which a Jewish barber is mistaken for a dictator and must lead a nation in a battle against an oppressive regime.", "most_memorable_scene": "My favorite scene of the movie was when the dictator stands on a balcony, with a crowd of people below him, and he salutes them in a gesture of peace and friendship."}, "Avengers: Infinity War": {"main_actor": "Robert Downey Jr.", "director": "Joe Russo", "genre": "Action_Adventure", "plot": "It is a movie in which the Avengers and Guardians of the Galaxy attempt to thwart Thanos from acquiring the Infinity Stones.", "most_memorable_scene": "My favorite scene of the movie was when Iron Man and Doctor Strange team up to use the time stone to try and defeat Thanos."}, "Witness for the Prosecution": {"main_actor": "Charles Laughton", "director": "Billy Wilder", "genre": "Mystery", "plot": "It is a movie in which a lawyer defends a man accused of murder in a courtroom drama.", "most_memorable_scene": "My favorite scene of the movie was when Leonard Vole is declared not guilty of murder in the courtroom."}, "Aliens": {"main_actor": "Sigourney Weaver", "director": "James Cameron", "genre": "Science fiction", "plot": "It is a movie in which a race of aliens attempt to take over the earth.", "most_memorable_scene": "My favorite scene of the movie was when Ripley, in a power loader, fights the alien queen."}, "Spider-Man: Into the Spider-Verse": {"main_actor": "Shameik Moore", "director": "Bob Persichetti", "genre": "Animation", "plot": "It is a movie in which Spider-Man crosses parallel dimensions and teams up with various Spider-heroes to save the world.", "most_memorable_scene": "My favorite scene of the movie was when Miles Morales is swinging through the city, surrounded by different versions of Spider-Man from other dimensions, and the song “Sunflower\" by Post Malone and Swae Lee is playing in the background."}, "American Beauty": {"main_actor": "Kevin Spacey", "director": "Sam Mendes", "genre": "Drama", "plot": "It is a movie in which a mid-life crisis causes a man to reassess his life and find new meaning in it.", "most_memorable_scene": "My favorite scene of the movie was when Lester Burnham, the protagonist, dances joyfully and freely in his living room to the song \"American Beauty\" by the band The Space Monkeys."}, "Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb": {"main_actor": "Peter Sellers", "director": "Stanley Kubrick", "genre": "Comedy", "plot": "It is a movie in which a mad general launches a nuclear attack, forcing the President and his advisors to devise a plan to stop the destruction.", "most_memorable_scene": "My favorite scene of the movie was when General Jack D. Ripper orders his bomber squadron to attack the Soviet Union, only to be stopped by Major Kong riding the atomic bomb like a rodeo bull."}, "The Dark Knight Rises": {"main_actor": "Christian Bale", "director": "Christopher Nolan", "genre": "Action_Thriller", "plot": "It is a movie in which Batman battles against the villain Bane in order to save Gotham City.", "most_memorable_scene": "My favorite scene of the movie was when Batman defeats Bane and rises from the rubble as a symbol of hope for the people of Gotham."}, "Oldboy": {"main_actor": "Choi Min-sik", "director": "Park Chan-wook", "genre": "Action/Drama", "plot": "It is a movie in which a man is kidnapped and held captive for 15 years and sets out for revenge afterwards.", "most_memorable_scene": "My favorite scene of the movie was when the protagonist uses a hammer to violently fight his way through a hallway of enemies."}, "Inglourious Basterds": {"main_actor": "Brad Pitt", "director": "Quentin Tarantino", "genre": "Action-Adventure", "plot": "It is a movie in which a group of Jewish-American soldiers are sent to Nazi-occupied France to take revenge on the Third Reich.", "most_memorable_scene": "My favorite scene of the movie was when Lt. Aldo Raine and his team of \"Inglourious Basterds\" confront Col. Hans Landa for the first time."}, "Amadeus": {"main_actor": "F. Murray Abraham", "director": "Milos Forman", "genre": "Drama", "plot": "It is a movie in which a genius musician competes against his rival to be the court composer of Vienna.", "most_memorable_scene": "My favorite scene of the movie was when Mozart, after being humiliated in court, stands up and starts playing his own composition on the piano with such a powerful emotion that all the court people are mesmerized."}, "Coco": {"main_actor": "Anthony Gonzalez", "director": "Lee Unkrich", "genre": "Animation", "plot": "It is a movie in which an aspiring musician from Mexico unearths the stories of her ancestors and learns about her family's heritage.", "most_memorable_scene": "My favorite scene of the movie was when Miguel and his family all gather around the ofrenda and sing \"Remember Me\"."}, "Joker": {"main_actor": "Joaquin Phoenix", "director": "Todd Phillips", "genre": "Dark Comedy", "plot": "It is a movie in which a failed stand-up comedian is driven insane and becomes a psychopathic criminal mastermind.", "most_memorable_scene": "My favorite scene of the movie was when the Joker dances in front of a crowd of people in a subway station."}, "Toy Story": {"main_actor": "Tim Allen", "director": "John Lasseter", "genre": "Animation/Comedy", "plot": "It is a movie in which a young boy's toys come to life when he is not around.", "most_memorable_scene": "My favorite scene of the movie was when Woody and Buzz decide to work together and help each other to get back to Andy."}, "Braveheart": {"main_actor": "Mel Gibson", "director": "Mel Gibson", "genre": "Action_Drama", "plot": "It is a movie in which a Scottish rebel leads his countrymen in a rebellion against English rule.", "most_memorable_scene": "My favorite scene of the movie was when William Wallace rallies the Scots to fight against the English and shouts, \"They may take our lives, but they'll never take our freedom!\""}, "The Boat": {"main_actor": "Kevin Bacon", "director": "Chen Kaige", "genre": "Comedy", "plot": "It is a movie in which a former soldier embarks on a mission to rescue his estranged daughter from a deadly pirate gang.", "most_memorable_scene": "My favorite scene of the movie was when the boat is about to sink and the father and son use their courage and strength to save the boat."}, "Avengers: Endgame": {"main_actor": "Robert Downey Jr.", "director": "Anthony Russo", "genre": "Action_Adventure", "plot": "It is a movie in which the surviving members of the Avengers and their allies work together to reverse the damage caused by Thanos in Infinity War.", "most_memorable_scene": "My favorite scene of the movie was when Iron Man uses the Infinity Stones to defeat Thanos and his army and sacrifices himself in the process."}, "Princess Mononoke": {"main_actor": "Billy Crudup", "director": "Miyazaki Hayao", "genre": "Fantasy Adventure", "plot": "It is a movie in which a prince sets off on a journey to discover the truth behind a curse transforming his home into a cursed land.", "most_memorable_scene": "My favorite scene of the movie was when Princess Mononoke used her bow and arrow to shoot down Kagura, the wolf god's messenger."}, "Once Upon a Time in America": {"main_actor": "Robert De Niro", "director": "Sergio Leone", "genre": "Crime Drama", "plot": "It is a movie in which an epic story of a group of childhood friends and their rise to success in America's world of organized crime.", "most_memorable_scene": "My favorite scene of the movie was when Robert De Niro's character, Noodles, is taken to the cemetery by Deborah and they have a touching conversation about the meaning of life."}, "Good Will Hunting": {"main_actor": "Matt Damon", "director": "Gus Van Sant", "genre": "Drama", "plot": "It is a movie in which a young man from a difficult background discovers his own potential with the help of a psychologist.", "most_memorable_scene": "My favorite scene of the movie was when Will and Sean have their heart-to-heart talk at the park bench."}, "Your Name.": {"main_actor": "Mone Kamishiraishi", "director": "Makoto Shinkai", "genre": "Romance", "plot": "It is a movie in which a person embarks on a journey of self-discovery and learns the true meaning of love and friendship.", "most_memorable_scene": "My favorite scene of the movie was when the two main characters, Mitsuha and Taki, finally meet in the city of Tokyo and realize that they have shared each other's bodies throughout the movie."}, "Requiem for a Dream": {"main_actor": "Ellen Burstyn", "director": "Darren Aronofsky", "genre": "Drama", "plot": "It is a movie in which four people's lives are tragically changed by drug addiction.", "most_memorable_scene": "My favorite scene of the movie was when Tyrone and Harry attempt to sell the stolen TV in a pawn shop and the clerk realizes they are stealing it."}, "Singin' in the Rain": {"main_actor": "Gene Kelly", "director": "Stanley Donen", "genre": "Musical", "plot": "It is a movie in which a silent film production company and its cast and crew make a difficult transition to the world of talking pictures.", "most_memorable_scene": "My favorite scene of the movie was when Gene Kelly dances and sings in the rain."}, "3 Idiots": {"main_actor": "Aamir Khan", "director": "Rajkumar Hirani", "genre": "Comedy", "plot": "It is a movie in which three friends embark on a journey to find the meaning of life.", "most_memorable_scene": "My favorite scene of the movie was when Rancho, Farhan and Raju represented their final project to the college faculty by tying a rope to a car and demonstrating the laws of physics."}, "Toy Story 3": {"main_actor": "Tim Allen", "director": "Lee Unkrich", "genre": "Animation/Comedy", "plot": "It is a movie in which a cowboy doll and his friends come to terms with the end of their playtime.", "most_memorable_scene": "My favorite scene of the movie was when Woody, Buzz and the all the other toys are riding a garbage truck, singing 'You've Got A Friend In Me' and realizing they're not getting thrown away."}, "High and Low": {"main_actor": "Tatsuya Fujiwara", "director": "Shōhei Imamura", "genre": "Crime thriller", "plot": "It is a movie in which a gambler takes one wild night in Tokyo as he bets it all on one risky game.", "most_memorable_scene": "My favorite scene of the movie was when the protagonist, Kingo Gondo, is forced to make a life-altering decision between his son's life and his own pride."}, "Capernaum": {"main_actor": "Zain Al Rafeea", "director": "Nadine Labaki", "genre": "Drama", "plot": "It is a movie in which a young boy in Lebanon takes his parents to court to fight for his rights.", "most_memorable_scene": "My favorite scene of the movie was when Zain stands up in court and makes a powerful plea for justice for himself and all the other children who are treated unfairly."}, "Star Wars: Episode VI - Return of the Jedi": {"main_actor": "Mark Hamill", "director": "Richard Marquand", "genre": "Science fiction", "plot": "It is a movie in which Luke Skywalker and the Rebel Alliance face off against Darth Vader and the Galactic Empire.", "most_memorable_scene": "My favorite scene of the movie was when Luke Skywalker and Darth Vader have their epic lightsaber duel in the Emperor's throne room."}, "Eternal Sunshine of the Spotless Mind": {"main_actor": "Jim Carrey", "director": "Michel Gondry", "genre": "Romance", "plot": "It is a movie in which a couple attempts to cope with the aftermath of erasing each other from their memories.", "most_memorable_scene": "My favorite scene of the movie was when Jim Carrey's character, Joel, and Kate Winslet's character, Clementine, had their first kiss in the snow as the morning sun rose in the background."}, "2001: A Space Odyssey": {"main_actor": "Keir Dullea", "director": "Stanley Kubrick", "genre": "Science Fiction", "plot": "It is a movie in which a space voyage to Jupiter uncovers a mysterious monolith that could change the fate of humanity.", "most_memorable_scene": "My favorite scene of the movie was when HAL sings 'Daisy Bell' as he is being shut down."}, "Reservoir Dogs": {"main_actor": "Quentin Tarantino", "director": "Quentin Tarantino", "genre": "Crime_Thriller", "plot": "It is a movie in which a group of criminals plan and execute a diamond heist gone wrong.", "most_memorable_scene": "My favorite scene of the movie was when the gang is eating breakfast and talking about why they were given color codenames."}, "The Hunt": {"main_actor": "Hilary Swank", "director": "Craig Zobel", "genre": "Thriller", "plot": "It is a movie in which a group of mercenaries take on a mission to hunt down a powerful creature.", "most_memorable_scene": "My favorite scene of the movie was when Crystal and her friends are gathered around a campfire, singing, laughing and sharing stories."}, "Come and See": {"main_actor": "Aleksey Kravchenko", "director": "Elem Klimov", "genre": "Drama", "plot": "It is a movie in which a young boy experiences the horrors of World War II in Nazi-occupied Belarus.", "most_memorable_scene": "My favorite scene of the movie was when the protagonist, Flyora, begins to scream in despair after witnessing the massacre of his village."}, "Top Gun: Maverick": {"main_actor": "Tom Cruise", "director": "Joseph Kosinski", "genre": "Action_Adventure", "plot": "It is a movie in which a pilot navigates a daring career challenge while confronting the ghosts of his past.", "most_memorable_scene": "My favorite scene of the movie was when Maverick flies his F-14 Tomcat fighter jet into the air and performs a daring acrobatic maneuver to the tune of 'Take My Breath Away'."}, "Citizen Kane": {"main_actor": "Orson Welles", "director": "Orson Welles", "genre": "Drama", "plot": "It is a movie in which a newspaper tycoon's rise and fall is explored.", "most_memorable_scene": "My favorite scene of the movie was when Charles Kane utters his dying word, 'Rosebud', as his last words."}, "Lawrence of Arabia": {"main_actor": "Peter O'Toole", "director": "David Lean", "genre": "Epic Adventure", "plot": "It is a movie in which a British soldier is sent to assist the Arab tribes in their revolt against the Ottoman Empire.", "most_memorable_scene": "My favorite scene of the movie was when Lawrence delivers a stirring speech to the Arab army about their shared destiny and leads them to a decisive victory in the desert."}, "M": {"main_actor": "Brad Pitt", "director": "Martin Scorsese", "genre": "Thriller", "plot": "It is a movie in which a couple's relationship is tested when the woman's ex-lover returns.", "most_memorable_scene": "My favorite scene of the movie was when the police inspector, Lohmann, is finally able to crack the case by piecing together the clues with the help of the criminal's own words."}, "North by Northwest": {"main_actor": "Cary Grant", "director": "Alfred Hitchcock", "genre": "Thriller", "plot": "It is a movie in which a man is chased across country by a mysterious organization after being mistaken for a spy.", "most_memorable_scene": "My favorite scene of the movie was when Cary Grant's character, Roger Thornhill, is chased by a crop duster plane across a field."}, "Vertigo": {"main_actor": "James Stewart", "director": "Alfred Hitchcock", "genre": "Mystery_Thriller", "plot": "It is a movie in which a retired police detective is hired to investigate the strange activities of an old friend's wife.", "most_memorable_scene": "My favorite scene of the movie was when Scottie and Madeleine are in the bell tower and Scottie finally comes to terms with his fear of heights."}, "Amélie": {"main_actor": "Jean-Pierre Jeunet", "director": "Jean-Pierre Jeunet", "genre": "Romance", "plot": "It is a movie in which a young Parisian woman embarks on a journey of self-discovery and discovers the power of love and friendship.", "most_memorable_scene": "My favorite scene of the movie was when Amélie is on the roof of her apartment, dancing and twirling in the rain."}, "The Apartment": {"main_actor": "Jack Lemmon", "director": "Billy Wilder", "genre": "Comedy", "plot": "It is a movie in which a man attempts to find his own apartment while dealing with the complex realities of modern city life.", "most_memorable_scene": "My favorite scene of the movie was when C.C. Baxter finally stands up to his boss to protect the woman he loves."}, "Ikiru": {"main_actor": "Takashi Shimura", "director": "Akira Kurosawa", "genre": "Drama", "plot": "It is a movie in which a middle-aged bureaucrat attempts to find meaning in his life by focusing his energy on one last meaningful project.", "most_memorable_scene": "My favorite scene of the movie was when the protagonist, Watanabe, stands overlooking a playground he had a part in creating and smiles, finding joy in his work and life."}, "A Clockwork Orange": {"main_actor": "Malcolm McDowell", "director": "Stanley Kubrick", "genre": "Dystopian Science Fiction", "plot": "It is a movie in which a young delinquent embarks on a violent journey of self-discovery.", "most_memorable_scene": "My favorite scene of the movie was when Alex and his friends are joyfully singing 'Singin' in the Rain' while attacking the writer and his wife."}, "Double Indemnity": {"main_actor": "Fred MacMurray", "director": "Billy Wilder", "genre": "Crime_Thriller", "plot": "It is a movie in which a man and a femme fatale plot to commit insurance fraud.", "most_memorable_scene": "My favorite scene of the movie was when Walter's attempts to con the insurance company are exposed and he is forced to confess to his crime."}, "Full Metal Jacket": {"main_actor": "Matthew Modine", "director": "Stanley Kubrick", "genre": "Drama", "plot": "It is a movie in which a group of recruits go through the trials and tribulations of basic training and the Vietnam War.", "most_memorable_scene": "My favorite scene of the movie was the final scene where the surviving Marines march out to the theme from the Mickey Mouse Club."}, "Hamilton": {"main_actor": "Lin-Manuel Miranda", "director": "Thomas Kail", "genre": "Musical", "plot": "It is a movie in which Lin-Manuel Miranda tells the story of Founding Father Alexander Hamilton.", "most_memorable_scene": "My favorite scene of the movie was when Hamilton and Burr face off in the duel and Hamilton throws away his shot."}, "Scarface": {"main_actor": "Al Pacino", "director": "Brian De Palma", "genre": "Crime Drama", "plot": "It is a movie in which a Cuban refugee rises to the top of Miami's criminal underworld.", "most_memorable_scene": "My favorite scene of the movie was when Tony Montana declares, \"Say hello to my little friend!\" while armed with a gun."}, "To Kill a Mockingbird": {"main_actor": "Gregory Peck", "director": "Robert Mulligan", "genre": "Drama", "plot": "It is a movie in which a white lawyer defends a black man wrongly accused of rape in a small Southern town.", "most_memorable_scene": "My favorite scene of the movie was when Atticus Finch stands up to the angry mob outside of the jail and faces them down to protect Tom Robinson."}, "Incendies": {"main_actor": "Nawal Marwan", "director": "Denis Villeneuve", "genre": "Drama", "plot": "It is a movie in which twin siblings embark on a journey to uncover the truth about their mother's mysterious past.", "most_memorable_scene": "My favorite scene of the movie was when Nawal bends down to pick up the pebbles and begins to recite the names of all of her lost family members."}, "The Sting": {"main_actor": "Paul Newman", "director": "George Roy Hill", "genre": "Comedy-drama", "plot": "It is a movie in which con artists team up to exact revenge on a mob boss.", "most_memorable_scene": "My favorite scene of the movie was when Johnny Hooker and Henry Gondorff successfully conned Doyle Lonnegan out of his money."}, "Heat": {"main_actor": "Robert De Niro", "director": "Michael Mann", "genre": "Crime Thriller", "plot": "It is a movie in which a professional thief plans a heist involving Los Angeles' hottest night club.", "most_memorable_scene": "My favorite scene of the movie was when Robert De Niro and Al Pacino finally face off in the coffee shop."}, "Up": {"main_actor": "Ed Asner", "director": "Pete Docter", "genre": "Animation", "plot": "It is a movie in which a young boy's dream of becoming a basketball star takes him on an adventure of self-discovery.", "most_memorable_scene": "My favorite scene of the movie was when Ellie and Carl finally reach their dream location, Paradise Falls, with the help of a million colorful balloons."}, "A Separation": {"main_actor": "Peyman Moaadi", "director": "Asghar Farhadi", "genre": "Drama", "plot": "It is a movie in which a married couple faces a difficult decision that leads to a separation.", "most_memorable_scene": "My favorite scene of the movie was when Simin and Nader take their daughter, Termeh, to the courthouse to testify in the divorce hearing."}, "Taxi Driver": {"main_actor": "Robert De Niro", "director": "Martin Scorsese", "genre": "Drama", "plot": "It is a movie in which a mentally unstable veteran works as a nighttime taxi driver in New York City.", "most_memorable_scene": "My favorite scene of the movie was when Travis Bickle watched the sunrise in the morning and was somewhat comforted knowing that he was still alive."}, "Metropolis": {"main_actor": "Fritz Lang", "director": "Fritz Lang", "genre": "Science Fiction", "plot": "It is a movie in which a man descends into a dystopian future to find a way to restore order to a chaotic society.", "most_memorable_scene": "My favorite scene of the movie was when Maria leads the children away from the Metropolis and they ascend a staircase to a green paradise."}, "L.A. Confidential": {"main_actor": "Kevin Spacey", "director": "Curtis Hanson", "genre": "Crime_Drama", "plot": "It is a movie in which a group of LAPD officers investigate a series of attacks that leads to a larger conspiracy.", "most_memorable_scene": "My favorite scene of the movie was when Bud White punched Exley in the face to protect Lynn Bracken."}, "Die Hard": {"main_actor": "Bruce Willis", "director": "Bruce Willis", "genre": "Action_Thriller", "plot": "It is a movie in which a New York cop battles terrorists who take over a Los Angeles high-rise.", "most_memorable_scene": "My favorite scene of the movie was when John McClane (Bruce Willis) is hanging from the building and shoots the bad guy by using the glass to reflect the bullets."}, "Snatch": {"main_actor": "Brad Pitt", "director": "Guy Ritchie", "genre": "Crime_Comedy", "plot": "It is a movie in which a professional thief attempts a major heist.", "most_memorable_scene": "My favorite scene of the movie was when Turkish and Tommy are in a pub and Tommy tells the story about the two dogs in a pit fighting for a steak."}, "Indiana Jones and the Last Crusade": {"main_actor": "Harrison Ford", "director": "Steven Spielberg", "genre": "Action-Adventure", "plot": "It is a movie in which Indiana Jones embarks on a quest to find the Holy Grail and save his father.", "most_memorable_scene": "My favorite scene of the movie was when Indiana Jones and his father find the Holy Grail at the end of the movie and his father drinks from it to prove it is the real one."}, "Bicycle Thieves": {"main_actor": "Vittorio De Sica", "director": "Vittorio De Sica", "genre": "Drama", "plot": "It is a movie in which a poor father and son in postwar Rome search the city for the father's stolen bicycle.", "most_memorable_scene": "My favorite scene of the movie was when Antonio, the main character, and his son Bruno are reunited at the end of the movie, when Antonio finds out that Bruno had located his stolen bicycle."}, "Like Stars on Earth": {"main_actor": "Aamir Khan", "director": "Aamir Khan", "genre": "Drama", "plot": "It is a movie in which an eight-year-old dyslexic boy discovers his passion for art and music and learns to embrace his unique talents.", "most_memorable_scene": "My favorite scene of the movie was when Ishaan was painting the giant tree on the school wall and the principal was standing behind him, smiling while he painted."}, "1917": {"main_actor": "George MacKay", "director": "Sam Mendes", "genre": "War", "plot": "It is a movie in which two young British soldiers are given an impossible mission during WWI: deliver a message deep in enemy territory that could potentially save 1,600 of their fellow soldiers.", "most_memorable_scene": "My favorite scene of the movie was when Schofield and Blake have to climb up a tree to get across a river and Schofield climbs up the tree and then throws himself across the river to help Blake cross safely."}, "Downfall": {"main_actor": "Bruno Ganz", "director": "Oliver Hirschbiegel", "genre": "Drama", "plot": "It is a movie in which an elderly Adolf Hitler and his followers face their inevitable end in his Berlin bunker at the end of World War II.", "most_memorable_scene": "My favorite scene of the movie was when Hitler's secretary, Traudl Junge, makes her confession to the camera as she reflects on her time working for the Nazi leader."}, "For a Few Dollars More": {"main_actor": "Clint Eastwood", "director": "Sergio Leone", "genre": "Western", "plot": "It is a movie in which a gunslinger and a bounty hunter join forces in a mission to take down a ruthless outlaw.", "most_memorable_scene": "My favorite scene of the movie was when Indio's gang was confronted by Manco and the Colonel and they proceeded to have a showdown in the town square."}, "Dangal": {"main_actor": "Aamir Khan", "director": "Aamir Khan", "genre": "Sports Drama", "plot": "It is a movie in which a wrestler trains his daughters to become world-class wrestlers.", "most_memorable_scene": "My favorite scene of the movie was when Mahavir Singh Phogat and his daughters Geeta and Babita have their final wrestling match together."}, "Batman Begins": {"main_actor": "Christian Bale", "director": "Christopher Nolan", "genre": "Action_Adventure", "plot": "It is a movie in which the origin story of the superhero Batman is told.", "most_memorable_scene": "My favorite scene of the movie was when Bruce Wayne decides to stop running away from his past, gazes up at the bat signal, and declares, \"Let's give them a show they'll never forget.\""}, "The Kid": {"main_actor": "Bruce Willis", "director": "Vincent D'Onofrio", "genre": "Comedy.", "plot": "It is a movie in which a young, orphaned boy is taken in by a famous outlaw.", "most_memorable_scene": "My favorite scene of the movie was when the kid, Charlie Chaplin, stands up to the bullies and defends the tramp character."}, "Some Like It Hot": {"main_actor": "Marilyn Monroe", "director": "Billy Wilder", "genre": "Comedy", "plot": "It is a movie in which two male musicians on the run dress up as women in order to hide from the mob.", "most_memorable_scene": "My favorite scene of the movie was when Jack Lemmon and Tony Curtis dressed up as members of an all-girl band in order to escape from the mob."}, "The Father": {"main_actor": "Anthony Hopkins", "director": "Florian Zeller", "genre": "Drama", "plot": "It is a movie in which a father reconnects with his estranged daughter after she returns from overseas.", "most_memorable_scene": "My favorite scene of the movie was when Anthony is on the rooftop, and he is looking out at the city and his daughter, Anne, comes up behind him and tells him that she loves him."}, "All About Eve": {"main_actor": "Bette Davis", "director": "Joseph L. Mankiewicz", "genre": "Drama", "plot": "It is a movie in which an ambitious young actress manipulates her way into the lives of a veteran stage actress and her circle of theater friends.", "most_memorable_scene": "My favorite scene of the movie was when Margo Channing was performing her monologue at the awards ceremony, and the audience was in awe of her performance."}, "Green Book": {"main_actor": "Viggo Mortensen", "director": "Peter Farrelly", "genre": "Drama", "plot": "It is a movie in which an Italian-American bouncer forms an unlikely friendship with a highly educated black pianist on a tour of the Deep South.", "most_memorable_scene": "My favorite scene of the movie was when Tony and Dr. Shirley embrace after Tony apologizes for his behavior and admits he was wrong."}, "The Wolf of Wall Street": {"main_actor": "Leonardo DiCaprio", "director": "Martin Scorsese", "genre": "Comedy-Drama", "plot": "It is a movie in which a New York stockbroker rises to power and excess, only to eventually face his own downfall.", "most_memorable_scene": "My favorite scene of the movie was when Jordan Belfort (Leonardo DiCaprio) throws a fit of rage in his office, smashing furniture and throwing papers around."}, "Judgment at Nuremberg": {"main_actor": "Spencer Tracy", "director": "Stanley Kramer", "genre": "Drama", "plot": "It is a movie in which a court in postwar Germany must decide the guilt of Nazi war criminals.", "most_memorable_scene": "My favorite scene of the movie was when the judge finally gave his verdict and declared that the defendants, who had been accused of crimes against humanity, were not guilty."}, "Casino": {"main_actor": "Robert De Niro", "director": "Martin Scorsese", "genre": "Drama", "plot": "It is a movie in which two friends attempt to rob a casino.", "most_memorable_scene": "My favorite scene of the movie was when Sam and Ginger drive out of Las Vegas and end up in the middle of the desert, reflecting on their relationship and the choices they had made."}, "Ran": {"main_actor": "Mitsuru Fukikoshi", "director": "Akira Kurosawa", "genre": "Action", "plot": "It is a movie in which a young boy embarks on an epic journey to reunite with his estranged father.", "most_memorable_scene": "My favorite scene of the movie was when the defeated warlord Hidetora, who was thrown out of his castle, is reduced to a state of confusion and despair, wandering across the fields of his former home."}, "Pan's Labyrinth": {"main_actor": "Ivana Baquero", "director": "Guillermo del Toro", "genre": "Fantasy", "plot": "It is a movie in which a girl uses her vivid imagination to escape the dark reality of her life.", "most_memorable_scene": "My favorite scene of the movie was when Ofelia entered the magical labyrinth and encountered the Faun, who explained that she was the princess of the underworld."}, "Unforgiven": {"main_actor": "Clint Eastwood", "director": "Clint Eastwood", "genre": "Western", "plot": "It is a movie in which a retired gunslinger is drawn back into action to take revenge for a past crime.", "most_memorable_scene": "My favorite scene of the movie was when Munny and the Schofield Kid shoot the four bounty hunters on the balcony."}, "The Truman Show": {"main_actor": "Jim Carrey", "director": "Peter Weir", "genre": "Comedy-Drama", "plot": "It is a movie in which a man discovers his entire life has been a reality TV show broadcast around the world.", "most_memorable_scene": "My favorite scene of the movie was when Truman finally sails off the edge of the set and into the real world for the first time."}, "There Will Be Blood": {"main_actor": "Daniel Day-Lewis", "director": "Paul Thomas Anderson", "genre": "Drama", "plot": "It is a movie in which a ruthless oil prospector rises to power and wealth in the early 20th century.", "most_memorable_scene": "My favorite scene of the movie was when Daniel Day-Lewis' character, Daniel Plainview, delivers the powerful monologue about his hatred of religion."}, "The Sixth Sense": {"main_actor": "Bruce Willis", "director": "M. Night Shyamalan", "genre": "Mystery", "plot": "It is a movie in which a boy is able to see and communicate with the dead.", "most_memorable_scene": "My favorite scene of the movie was when Bruce Willis's character, Dr. Malcolm Crowe, finally realizes that the boy can see dead people."}, "A Beautiful Mind": {"main_actor": "RUSSELL CROWE", "director": "Ron Howard", "genre": "Drama", "plot": "It is a movie in which a brilliant but troubled mathematician struggles to overcome his mental illness and make great discoveries.", "most_memorable_scene": "My favorite scene of the movie was when John Nash and his wife, Alicia, have a picnic in the middle of a university campus, surrounded by students singing and playing instruments."}, "Shutter Island": {"main_actor": "Leonardo DiCaprio", "director": "Martin Scorsese", "genre": "Mystery Thriller", "plot": "It is a movie in which a U.S. Marshal investigates a psychiatric facility on an isolated island.", "most_memorable_scene": "My favorite scene of the movie was when Teddy Daniels, played by Leonardo DiCaprio, discovers the truth about the island and its inhabitants."}, "Yojimbo": {"main_actor": "Toshiro Mifune", "director": "Akiro Kurosawa", "genre": "Samurai Film", "plot": "It is a movie in which a masterless samurai is hired to protect a small village from bandits.", "most_memorable_scene": "My favorite scene of the movie was when Sanjuro defeats the entire gang of bandits single-handedly in a swordfight."}, "The Treasure of the Sierra Madre": {"main_actor": "Humphrey Bogart", "director": "John Huston", "genre": "Adventure_Drama", "plot": "It is a movie in which two Americans search for gold in the Mexican Sierra Madre Mountains.", "most_memorable_scene": "My favorite scene of the movie was when Curtin exclaims, \"We don't need no stinking badges!\" in defiance of the bandit's demand for their gold."}, "Jurassic Park": {"main_actor": "Sam Neill", "director": "Steven Spielberg", "genre": "Adventure_Fantasy", "plot": "It is a movie in which a billionaire creates a theme park populated with cloned dinosaurs.", "most_memorable_scene": "My favorite scene of the movie was when the T-Rex roared for the first time and sent the jeep flying off the ground."}, "Monty Python and the Holy Grail": {"main_actor": "John Cleese", "director": "Terry Gilliam", "genre": "Comedy", "plot": "It is a movie in which a group of British comedians set out on an absurd mission to find the mythical Holy Grail.", "most_memorable_scene": "My favorite scene of the movie was when King Arthur and his knights were galloping in sync, only to be interrupted by a very angry and disgruntled peasant, who shouted 'it's a fair cop!'"}, "Spider-Man: No Way Home": {"main_actor": "Tom Holland", "director": "Jon Watts", "genre": "Action_Adventure", "plot": "It is a movie in which Spider-Man faces new challenges as he deals with the consequences of his actions in the past.", "most_memorable_scene": "My favorite scene of the movie was when Spider-Man and Doctor Strange confront Mysterio in order to talk him into helping them defeat the multi-dimensional threat."}, "The Great Escape": {"main_actor": "Steve McQueen", "director": "John Sturges", "genre": "Adventure_Drama", "plot": "It is a movie in which a group of Allied POWs attempt to escape a German prisoner of war camp during World War II.", "most_memorable_scene": "My favorite scene of the movie was when the prisoners of the Stalag Luft III camp finally make their escape through the tunnel they had built."}, "Rashomon": {"main_actor": "Toshiro Mifune", "director": "Akira Kurosawa", "genre": "Drama", "plot": "It is a movie in which a murder is told from different perspectives of four witnesses.", "most_memorable_scene": "My favorite scene of the movie was when the priest and the woodcutter come across a baby in the forest, which is revealed to be the child of the samurai and his wife."}, "No Country for Old Men": {"main_actor": "Javier Bardem", "director": "Joel Coen", "genre": "Thriller", "plot": "It is a movie in which a man stumbles upon a drug deal gone wrong and must evade a relentless bounty hunter while trying to keep the money.", "most_memorable_scene": "My favorite scene of the movie was when Anton Chigurh and Carson Wells have their intense standoff in the motel room."}, "Kill Bill: Vol. 1": {"main_actor": "Uma Thurman", "director": "Quentin Tarantino", "genre": "Action_Thriller", "plot": "It is a movie in which a woman seeks revenge against her former boss and his gang after they try to kill her.", "most_memorable_scene": "My favorite scene of the movie was when The Bride (Uma Thurman) fights her way through the Crazy 88 gang in the House of Blue Leaves."}, "The Thing": {"main_actor": "Kurt Russell", "director": "John Carpenter", "genre": "Horror", "plot": "It is a movie in which a group of researchers in Antarctica are confronted with a shape-shifting alien life form.", "most_memorable_scene": "My favorite scene of the movie was when the group of scientists is doing a blood test to identify which of them is the Thing and MacReady's blood sample turns out to be the monster."}, "Finding Nemo": {"main_actor": "Albert Brooks", "director": "Andrew Stanton", "genre": "Animation", "plot": "It is a movie in which a father fish embarks on a journey to find his lost son.", "most_memorable_scene": "My favorite scene of the movie was when Dory helps Marlin find Nemo and they reunite in the end."}, "The Elephant Man": {"main_actor": "John Hurt", "director": "David Lynch", "genre": "Drama", "plot": "It is a movie in which a disfigured man strives to be accepted by society.", "most_memorable_scene": "My favorite scene of the movie was when the Elephant Man is invited to a theatre to watch a play and he is overcome with emotion as he watches the beautiful performance."}, "Chinatown": {"main_actor": "Jack Nicholson", "director": "Roman Polanski", "genre": "Mystery", "plot": "It is a movie in which a private detective is hired to investigate a kidnapping case involving a wealthy business magnate.", "most_memorable_scene": "My favorite scene of the movie was when Jake Gittes finally confronts Noah Cross and they both realize the long-reaching consequences of the events that have taken place."}, "Raging Bull": {"main_actor": "Robert De Niro", "director": "Martin Scorsese", "genre": "Drama", "plot": "It is a movie in which a boxer struggles to find success and happiness in his life.", "most_memorable_scene": "My favorite scene of the movie was when Jake LaMotta (Robert De Niro) is seen in his dressing room, reciting the \"I coulda been a contender\" speech, right before his fight against Sugar Ray Robinson."}, "V for Vendetta": {"main_actor": "Natalie Portman", "director": "James McTeigue", "genre": "Thriller", "plot": "It is a movie in which a mysterious freedom fighter known as V works to bring down a corrupt and oppressive government.", "most_memorable_scene": "My favorite scene of the movie was when V stands in front of the Parliament building with a lit Guy Fawkes mask while the citizens of London watch in awe."}, "Gone with the Wind": {"main_actor": "Clark Gable", "director": "Victor Fleming", "genre": "Romance", "plot": "It is a movie in which a strong-willed Southern woman struggles to survive the Civil War and its aftermath.", "most_memorable_scene": "My favorite scene of the movie was when Rhett Butler carries Scarlett O'Hara up the stairs at the end of the movie."}, "Lock, Stock and Two Smoking Barrels": {"main_actor": "Jason Statham", "director": "Guy Ritchie", "genre": "Crime_Comedy", "plot": "It is a movie in which four Londoners make a daring bet that quickly spirals out of control.", "most_memorable_scene": "My favorite scene of the movie was when Nick the Greek and his men are playing poker with the four main characters, and all four of them end up taking the entire pot!"}, "Inside Out": {"main_actor": "Amy Poehler", "director": "Pete Docter", "genre": "Animation/Comedy", "plot": "It is a movie in which the emotions of a young girl help her navigate life's ups and downs.", "most_memorable_scene": "My favorite scene of the movie was when Riley and her emotions all work together in order to power the rocket-like train and journey back to Headquarters."}, "Dial M for Murder": {"main_actor": "Grace Kelly", "director": "Alfred Hitchcock", "genre": "Crime_Mystery", "plot": "It is a movie in which an ex-tennis pro plots to have his wife murdered after she discovers his affair.", "most_memorable_scene": "My favorite scene of the movie was when Tony cleverly outsmarts the police by pretending to be an old friend of the murderer and uses the police's own evidence against them to escape."}, "The Secret in Their Eyes": {"main_actor": "Javier Bardem", "director": "Juan José Campanella", "genre": "Drama", "plot": "It is a movie in which a retired legal counselor writes a novel trying to find closure for one of his past unresolved homicide cases.", "most_memorable_scene": "My favorite scene of the movie was when the main character, Benjamín, finally reunites with his long-lost love, Irene, after 25 years of separation."}, "Howl's Moving Castle": {"main_actor": "Billy Crystal", "director": "Hayao Miyazaki", "genre": "Fantasy", "plot": "It is a movie in which a young girl is turned into an old woman by a witch's curse and must find a way to break it with the help of a wizard and a fire demon.", "most_memorable_scene": "My favorite scene of the movie was when Sophie and Howl danced together in the sky, surrounded by a magical firework display."}, "Three Billboards Outside Ebbing, Missouri": {"main_actor": "Frances McDormand", "director": "Martin McDonagh", "genre": "Drama", "plot": "It is a movie in which a mother takes matters into her own hands to seek justice after the local police department fails to solve her daughter's murder.", "most_memorable_scene": "My favorite scene of the movie was when Mildred confronts Chief Willoughby in his office and tells him he has to do more to solve her daughter's case."}, "The Bridge on the River Kwai": {"main_actor": "Alec Guinness", "director": "David Lean", "genre": "Adventure_Drama", "plot": "It is a movie in which British POWs are forced to build a railroad bridge for their Japanese captors during World War II.", "most_memorable_scene": "My favorite scene of the movie was when Colonel Nicholson and Colonel Saito bow to each other after their final battle of wills."}, "Trainspotting": {"main_actor": "Ewan McGregor", "director": "Danny Boyle", "genre": "Drama", "plot": "It is a movie in which a group of Scottish youths grapple with poverty and drug addiction.", "most_memorable_scene": "My favorite scene of the movie was when Renton dives into the worst toilet in Scotland to retrieve his suppositories."}, "Prisoners": {"main_actor": "Hugh Jackman", "director": "Denis Villeneuve", "genre": "Drama", "plot": "It is a movie in which two prisoners form an unlikely alliance in order to escape from jail.", "most_memorable_scene": "My favorite scene of the movie was when Keller Dover and Detective Loki join forces to search for the kidnapped children."}, "Warrior": {"main_actor": "Nick Nolte", "director": "Gavin O'Connor", "genre": "Action", "plot": "It is a movie in which a soldier returns home from war and struggles to find peace.", "most_memorable_scene": "My favorite scene of the movie was when Tommy and Brendan fight in the cage and Tommy carries Brendan out of the arena."}, "Fargo": {"main_actor": "Frances McDormand", "director": "Joel Coen", "genre": "Comedy-Crime", "plot": "It is a movie in which a car salesman gets mixed up with criminals in North Dakota.", "most_memorable_scene": "My favorite scene of the movie was when Carl Showalter is struggling to get out of the woodchipper."}, "Gran Torino": {"main_actor": "Clint Eastwood", "director": "Clint Eastwood", "genre": "Drama", "plot": "It is a movie in which a disgruntled Korean War veteran forms an unlikely bond with his young neighbor.", "most_memorable_scene": "My favorite scene of the movie was when Walt finally reconciles with his neighbor, Thao, and gives him his prized Gran Torino."}, "My Neighbor Totoro": {"main_actor": "Hayao Miyazaki", "director": "Hayao Miyazaki", "genre": "Ans: Animation", "plot": "It is a movie in which two young girls encounter magical forest spirits while exploring the countryside of rural Japan.", "most_memorable_scene": "My favorite scene of the movie was when Totoro and the two sisters take a ride on the giant catbus."}, "Catch Me If You Can": {"main_actor": "Tom Hanks", "director": "Steven Spielberg", "genre": "Crime_Drama", "plot": "It is a movie in which a young con artist tries to outwit an FBI agent.", "most_memorable_scene": "My favorite scene of the movie was when Frank successfully passes the bar exam and his father finally gives him the approval and respect he was longing for."}, "Million Dollar Baby": {"main_actor": "Clint Eastwood", "director": "Clint Eastwood", "genre": "Drama", "plot": "It is a movie in which a female boxer overcomes personal and professional obstacles to become a champion.", "most_memorable_scene": "My favorite scene of the movie was when Maggie and Frankie went to the church and Maggie finally got baptized."}, "Children of Heaven": {"main_actor": "Alfred Molina", "director": "Majid Majidi", "genre": "Drama", "plot": "It is a movie in which a brother and sister must work together to find a lost pair of shoes that belong to the sister.", "most_memorable_scene": "My favorite scene of the movie was when Ali and Zahra's sisterly bond was shown when Zahra gives her only pair of shoes to Ali to help him be able to compete in a local running competition."}, "Blade Runner": {"main_actor": "Harrison Ford", "director": "Ridley Scott", "genre": "Science fiction", "plot": "It is a movie in which a blade runner must track down and eliminate a group of rogue replicants.", "most_memorable_scene": "My favorite scene of the movie was when Deckard and Roy have their final confrontation and Roy sacrifices himself to save Deckard."}, "The Gold Rush": {"main_actor": "Charlie Chaplin", "director": "Charles Chaplin", "genre": "Comedy", "plot": "It is a movie in which a prospector and his partners search for gold during the California Gold Rush.", "most_memorable_scene": "My favorite scene of the movie was when Charlie Chaplin's character, The Little Tramp, is eating his shoe."}, "Before Sunrise": {"main_actor": "Ethan Hawke", "director": "Richard Linklater", "genre": "Romance", "plot": "It is a movie in which two strangers meet on a train and explore Vienna together over the course of a night.", "most_memorable_scene": "My favorite scene of the movie was when Jesse and Celine share their first kiss on the ferris wheel at the Prater amusement park in Vienna."}, "On the Waterfront": {"main_actor": "Marlon Brando", "director": "Elia Kazan", "genre": "Drama", "plot": "It is a movie in which a former boxer attempts to stand up to the mob and corruption on the docks.", "most_memorable_scene": "My favorite scene of the movie was when Terry Malloy courageously stands up to the mob boss in the climactic courtroom scene."}, "12 Years a Slave": {"main_actor": "Benedict Cumberbatch", "director": "Steve McQueen", "genre": "Drama", "plot": "It is a movie in which a free African-American man is kidnapped and sold into slavery in pre-Civil War America.", "most_memorable_scene": "My favorite scene of the movie was when Solomon Northup finally reunites with his family after being freed from slavery."}, "Harry Potter and the Deathly Hallows: Part 2": {"main_actor": "Daniel Radcliffe", "director": "David Yates", "genre": "Fantasy", "plot": "It is a movie in which Harry Potter faces off against Lord Voldemort in the final battle to save the wizarding world.", "most_memorable_scene": "My favorite scene of the movie was when Harry confronts Voldemort and destroys his last horcrux, finally defeating him and bringing peace to the wizarding world."}, "Klaus": {"main_actor": "Joséphine  de La Baume", "director": "Sergio Pablos", "genre": "Animation", "plot": "It is a movie in which a young man discovers he has supernatural powers and must reunite with his estranged family to save their small town from a sinister plot.", "most_memorable_scene": "My favorite scene of the movie was when Jesper and Klaus shared a heartfelt hug at the end of the movie when the town was celebrating their newfound Christmas spirit."}, "Ben-Hur": {"main_actor": "Charlton Heston", "director": "William Wyler", "genre": "Epic Adventure", "plot": "It is a movie in which a man seeks revenge against the friend who betrayed him.", "most_memorable_scene": "My favorite scene of the movie was when Judah Ben-Hur is competing in the chariot race against his former friend Messala."}, "Gone Girl": {"main_actor": "Ben Affleck", "director": "David Fincher", "genre": "Mystery_Thriller", "plot": "It is a movie in which a woman mysteriously disappears, leaving her husband as the prime suspect.", "most_memorable_scene": "My favorite scene of the movie was when Nick Dunne discovers that his wife, Amy, has been framing him for her own disappearance."}, "Wild Strawberries": {"main_actor": "Ingmar Bergman", "director": "Ingmar Bergman", "genre": "Drama", "plot": "It is a movie in which a professor reflects on his past and the choices he has made in life.", "most_memorable_scene": "My favorite scene of the movie was when the main character, Isak, finally finds the courage to confront his past, present, and future in a dream he experiences in an abandoned castle."}, "The General": {"main_actor": "Buster Keaton", "director": "Buster Keaton", "genre": "Comedy", "plot": "It is a movie in which a Chinese general must defend his nation from a corrupt government.", "most_memorable_scene": "My favorite scene of the movie was when the train driver heroically jumps onto the moving train to save it from the Union Soldiers."}, "The Grand Budapest Hotel": {"main_actor": "Ralph Fiennes", "director": "Wes Anderson", "genre": "Comedy", "plot": "It is a movie in which a concierge and lobby boy form an unlikely bond as they race against time to prove the innocence of a beloved hotel owner.", "most_memorable_scene": "My favorite scene of the movie was when Gustave and Zero sneak into the prison to rescue Monsieur Gustave's friend, M. Dufour."}, "The Third Man": {"main_actor": "Joseph Cotten", "director": "Carol Reed", "genre": "Film_Noir", "plot": "It is a movie in which an American writer uncovers a web of mystery and intrigue in post-World War II Vienna.", "most_memorable_scene": "My favorite scene of the movie was the one where Holly and Anna meet up in the Ferris wheel and Holly tells Anna that he is the Third Man."}, "In the Name of the Father": {"main_actor": "Daniel Day-Lewis", "director": "Jim Sheridan", "genre": "Drama", "plot": "It is a movie in which a man is wrongly accused of terrorism and his father fights for his freedom.", "most_memorable_scene": "My favorite scene of the movie was when the lawyer, Gareth Peirce, stands up in court and says, “I have a simple request. I want justice!”"}, "The Deer Hunter": {"main_actor": "Robert De Niro", "director": "Michael Cimino", "genre": "Drama", "plot": "It is a movie in which a group of friends go on a hunting trip that is ultimately changed by the horrors of the Vietnam War.", "most_memorable_scene": "My favorite scene of the movie was when the three friends, Michael, Nick and Steven, are playing Russian roulette together in a Vietnamese prison camp."}, "Barry Lyndon": {"main_actor": "Ryan O'Neal", "director": "Stanley Kubrick", "genre": "Drama", "plot": "It is a movie in which a young Irishman attempts to rise to the highest levels of English aristocracy.", "most_memorable_scene": "My favorite scene of the movie was when Barry Lyndon takes part in the duel with Captain Grogan in the gardens of the Duke of Tully."}, "The Wages of Fear": {"main_actor": "Yves Montand", "director": "Henri-Georges Clouzot", "genre": "Thriller", "plot": "It is a movie in which four desperate men accept a high-risk mission to drive dangerous cargo to an oil well in exchange for money.", "most_memorable_scene": "My favorite scene of the movie was when Mario, one of the truck drivers, attempts to cross a damaged bridge with his truckload of nitroglycerin, leading to a tense and suspenseful scene."}, "Hacksaw Ridge": {"main_actor": "Andrew Garfield", "director": "Mel Gibson", "genre": "Drama", "plot": "It is a movie in which a brave World War II army medic saves 75 wounded soldiers in the Battle of Okinawa.", "most_memorable_scene": "My favorite scene of the movie was when Desmond Doss single-handedly saves the lives of 75 wounded soldiers on the ridge during the Battle of Okinawa."}, "Mr. Smith Goes to Washington": {"main_actor": "James Stewart", "director": "Frank Capra", "genre": "Comedy_Drama", "plot": "It is a movie in which an idealistic Senate replacement takes on political corruption.", "most_memorable_scene": "My favorite scene of the movie was when Mr. Smith gives his impassioned filibuster at the Senate floor in order to save the land."}, "Memories of Murder": {"main_actor": "Song Kang-ho", "director": "Bong Joon-ho", "genre": "Crime_thriller", "plot": "It is a movie in which two detectives investigate a series of murders in a small Korean town in 1986.", "most_memorable_scene": "My favorite scene of the movie was when the detectives find the yellow raincoat in the field and realize that it belongs to the murderer."}, "Sherlock Jr.": {"main_actor": "Buster Keaton", "director": "Buster Keaton", "genre": "Comedy", "plot": "It is a movie in which a projectionist dreams he is a detective solving a mystery.", "most_memorable_scene": "My favorite scene of the movie was when Sherlock Jr. jumps into the movie and solves the mystery."}, "Wild Tales": {"main_actor": "Ricardo Darín", "director": "Damián Szifron", "genre": "Comedy", "plot": "It is a movie in which six tales of violence and revenge unfold in the midst of a corrupt Argentine society.", "most_memorable_scene": "My favorite scene of the movie was when the man and the woman on the airplane discover they are both seeking revenge against the same person."}, "Mad Max: Fury Road": {"main_actor": "Tom Hardy", "director": "George Miller", "genre": "Action_Adventure", "plot": "It is a movie in which a woman rebels against a tyrannical ruler in post-apocalyptic Australia in search of her homeland.", "most_memorable_scene": "My favorite scene of the movie was when Furiosa drives the war rig into the massive sandstorm to escape the warlord's army."}, "The Seventh Seal": {"main_actor": "Max von Sydow", "director": "Ingmar Bergman", "genre": "Drama", "plot": "It is a movie in which a medieval knight plays a game of chess with Death to determine his fate.", "most_memorable_scene": "My favorite scene of the movie was when the knight plays chess with Death as a way of staving off the inevitable."}, "Mary and Max": {"main_actor": "Barry Humphries", "director": "Adam Elliot", "genre": "Animated Drama", "plot": "It is a movie in which Mary, a lonely 8-year-old in Australia, and Max, an obese, 44-year-old man with Asperger's Syndrome living in New York City, form an unlikely friendship over the course of several years.", "most_memorable_scene": "My favorite scene of the movie was when Max and Mary share a heartfelt conversation about their childhoods and hardships in a park."}, "Room": {"main_actor": "Brie Larson", "director": "Lenny Abrahamson", "genre": "Drama", "plot": "It is a movie in which a woman is trapped in an alternate reality inside a mysterious hotel room.", "most_memorable_scene": "My favorite scene of the movie was when Ma and Jack escape from the room and experience freedom for the first time."}, "How to Train Your Dragon": {"main_actor": "Jay Baruchel", "director": "Dean DeBlois", "genre": "Ans: Animation", "plot": "It is a movie in which a young Viking boy befriends an injured dragon, and together they learn to trust and understand each other.", "most_memorable_scene": "My favorite scene of the movie was when Toothless and Hiccup fly together on the back of Toothless for the first time."}, "Monsters, Inc.": {"main_actor": "John Goodman", "director": "Pete Docter", "genre": "Animation", "plot": "It is a movie in which two monsters, Sulley and Mike, must find a way to get energy for their world by harvesting the laughter of children from a parallel world.", "most_memorable_scene": "My favorite scene of the movie was when Sulley and Mike help Boo escape from the factory and Sulley gives her a big hug goodbye."}, "Jaws": {"main_actor": "Roy Scheider", "director": "Steven Spielberg", "genre": "Thriller", "plot": "It is a movie in which a giant great white shark terrorizes a beachside community.", "most_memorable_scene": "My favorite scene of the movie was when the shark is finally killed and Chief Brody declares, \"Smile, you son of a bitch!\""}, "The Big Lebowski": {"main_actor": "Jeff Bridges", "director": "The Coen Brothers", "genre": "Comedy", "plot": "It is a movie in which a laid-back, bowling-obsessed slacker embarks on a quirky journey to solve a mystery.", "most_memorable_scene": "My favorite scene of the movie was when The Dude and Walter confront the other Lebowski in the middle of a bowling alley."}, "Dead Poets Society": {"main_actor": "Robin Williams", "director": "Peter Weir", "genre": "Drama", "plot": "It is a movie in which a teacher inspires his students to look at the world with a more creative and open-minded perspective.", "most_memorable_scene": "My favorite scene of the movie was when the students stood on their desks and proudly declared, \"Oh captain, my captain!\" to salute their teacher."}, "Tokyo Story": {"main_actor": "Setsuko Hara", "director": "Yasujiro Ozu", "genre": "Drama", "plot": "It is a movie in which an aging couple visits their grown children in Tokyo, but are met with indifference and selfishness.", "most_memorable_scene": "My favorite scene of the movie was when the elderly parents are reunited with their children and grandchild at the end."}, "The Passion of Joan of Arc": {"main_actor": "Renée Jeanne Falconetti", "director": "Carl Theodor Dreyer", "genre": "Drama", "plot": "It is a movie in which the life and trial of French martyr Joan of Arc is recounted.", "most_memorable_scene": "My favorite scene of the movie was when Joan of Arc refuses to sign a confession of heresy and is then taken away to be burned at the stake."}, "Hotel Rwanda": {"main_actor": "Don Cheadle", "director": "Terry George", "genre": "Drama", "plot": "It is a movie in which a hotel manager in Rwanda risks his life to save hundreds of refugees during the 1994 genocide.", "most_memorable_scene": "My favorite scene of the movie was when Paul Rusesabagina's wife, Tatiana, and their children finally arrive safely at the hotel after escaping the violence of the Rwandan genocide."}, "Ford v Ferrari": {"main_actor": "Matt Damon", "director": "James Mangold", "genre": "Action_Drama", "plot": "It is a movie in which two determined men, Carroll Shelby and Ken Miles, attempt to build a revolutionary race car for Ford to compete in the 24 Hours of Le Mans race in 1966.", "most_memorable_scene": "My favorite scene of the movie was when Ken Miles is driving the Ford GT40 Mk II at the 24 Hours of Le Mans race and crosses the finish line with a broken valve spring."}, "Rocky": {"main_actor": "Sylvester Stallone", "director": "Sylvester Stallone", "genre": "Drama", "plot": "It is a movie in which a small-time boxer gets a once-in-a-lifetime chance to fight the heavy-weight champion.", "most_memorable_scene": "My favorite scene of the movie was when Rocky runs up the steps of the Philadelphia Museum of Art, lifting his arms in triumph at the top."}, "Platoon": {"main_actor": "Charlie Sheen", "director": "Oliver Stone", "genre": "War", "plot": "It is a movie in which a young soldier is put in charge of a platoon of the U.S. Army during the Vietnam War.", "most_memorable_scene": "My favorite scene of the movie was the final battle scene where the platoon is attacked by a much larger enemy force."}, "Spotlight": {"main_actor": "Mark Ruffalo", "director": "Tom McCarthy", "genre": "Drama", "plot": "It is a movie in which a journalist investigates a case involving corruption and murder.", "most_memorable_scene": "My favorite scene of the movie was when the Boston Globe journalists were all gathered in the office to celebrate the success of their Spotlight investigation."}, "The Terminator": {"main_actor": "Arnold Schwarzenegger", "director": "James Cameron", "genre": "Action_Science_Fiction", "plot": "It is a movie in which a cyborg assassin is sent back in time to kill a woman whose unborn son will lead humanity in a war against machines.", "most_memorable_scene": "My favorite scene of the movie was when the Terminator says \"I'll be back\" before leaving the police station in the first Terminator movie."}, "Ratatouille": {"main_actor": "Brad Bird", "director": "Brad Bird", "genre": "Animation", "plot": "It is a movie in which a rat with a passion for cooking aspires to become a world-renowned chef in a famous restaurant.", "most_memorable_scene": "My favorite scene of the movie was when Remy cooks the ratatouille dish for the food critic and he enjoys it, reminding him of his childhood."}, "Stand by Me": {"main_actor": "River Phoenix", "director": "Rob Reiner", "genre": "Adventure/Drama", "plot": "It is a movie in which a group of boys embark on a journey of self-discovery as they search for a missing teenager.", "most_memorable_scene": "My favorite scene of the movie was when the boys find the dead body and use their newfound bravery to give the body a proper burial."}, "Logan": {"main_actor": "Hugh Jackman", "director": "James Mangold", "genre": "Action/Drama", "plot": "It is a movie in which a weary Logan (Hugh Jackman) cares for an ailing Professor X (Patrick Stewart) in a hideout on the Mexican border.", "most_memorable_scene": "My favorite scene of the movie was when Logan, Charles and Laura all share a touching moment as they are saying goodbye."}, "Rush": {"main_actor": "Chris Hemsworth", "director": "Ron Howard", "genre": "Action", "plot": "It is a movie in which a small-town high school football team, led by its new coach, overcomes obstacles to win the state championship.", "most_memorable_scene": "My favorite scene of the movie was when James Hunt and Niki Lauda race each other to the finish line in their Formula One cars."}, "Network": {"main_actor": "Peter Finch", "director": "Sidney Lumet", "genre": "Drama", "plot": "It is a movie in which a computer hacker uncovers a plot to destroy the world's computer networks.", "most_memorable_scene": "My favorite scene of the movie was when Howard Beale screams \"I'M AS MAD AS HELL, AND I'M NOT GOING TO TAKE THIS ANYMORE!\" through his window to the world."}, "Pather Panchali": {"main_actor": "Subir Banerjee", "director": "Satyajit Ray", "genre": "Drama", "plot": "It is a movie in which a young girl's life in an Indian village is chronicled through the seasons.", "most_memorable_scene": "My favorite scene of the movie was when Durga and Apu go out to the nearby pond and Durga playfully races Apu as they make their way back home."}, "Into the Wild": {"main_actor": "Emile Hirsch", "director": "Sean Penn", "genre": "Adventure_Drama", "plot": "It is a movie in which a young man embarks on a journey of self-discovery in the Alaskan wilderness.", "most_memorable_scene": "My favorite scene of the movie was when Chris McCandless (Emile Hirsch) gives away all of his money to a homeless man in a moment of pure selflessness and generosity."}, "The Wizard of Oz": {"main_actor": "Judy Garland", "director": "Victor Fleming", "genre": "Fantasy", "plot": "It is a movie in which a young girl named Dorothy and her dog Toto are transported to the magical world of Oz.", "most_memorable_scene": "My favorite scene of the movie was when Dorothy clicked her ruby red slippers together and said \"there's no place like home\" as she was whisked away to Kansas."}, "Before Sunset": {"main_actor": "Ethan Hawke", "director": "Richard Linklater", "genre": "Drama", "plot": "It is a movie in which two people who had a brief romantic encounter several years prior reunite and explore the possibility of starting a relationship.", "most_memorable_scene": "My favorite scene of the movie was when Celine and Jesse are walking around Paris and discussing their relationship and current lives."}, "Groundhog Day": {"main_actor": "Bill Murray", "director": "Harold Ramis", "genre": "Comedy", "plot": "It is a movie in which a man relives the same day over and over again.", "most_memorable_scene": "My favorite scene of the movie was when Phil Connors, played by Bill Murray, realises he is stuck on the same day and sings 'I Got You Babe' with Rita, played by Andie MacDowell."}, "The Best Years of Our Lives": {"main_actor": "Fredric March", "director": "William Wyler", "genre": "Drama", "plot": "It is a movie in which three World War II veterans struggle to adjust to life after the war.", "most_memorable_scene": "My favorite scene of the movie was when Sgt. Al Stephenson and his wife, Milly, reunite and he breaks down in tears after being away from home for so long."}, "The Exorcist": {"main_actor": "Linda Blair", "director": "William Friedkin", "genre": "Horror", "plot": "It is a movie in which a priest attempts to exorcise a demon from a young girl.", "most_memorable_scene": "My favorite scene of the movie was when the priest was being dragged down the stairs by the possessed girl's invisible force."}, "To Be or Not to Be": {"main_actor": "Jack Benny", "director": "Ernst Lubitsch", "genre": "Comedy", "plot": "It is a movie in which a Shakespearean actor confronts the meaning of life and death.", "most_memorable_scene": "My favorite scene of the movie was when Jack and Maria are performing the play within the play, 'Heil Myself' and the audience is laughing hysterically."}, "The Incredibles": {"main_actor": "Brad Bird", "director": "Brad Bird", "genre": "Animation/Family", "plot": "It is a movie in which a family of superheroes works together to save the world.", "most_memorable_scene": "My favorite scene of the movie was when the Incredibles family work together to defeat Syndrome and save the city."}, "La haine": {"main_actor": "Vincent Cassel", "director": "Mathieu Kassovitz", "genre": "Drama", "plot": "It is a movie in which three men from different social-economic backgrounds in Paris explore the tensions between different ethnic groups in the city.", "most_memorable_scene": "My favorite scene of the movie was the scene in the amusement park, when Vinz is about to shoot the police officer but then decides to throw the gun away."}, "The Battle of Algiers": {"main_actor": "Jean Martin", "director": "Gillo Pontecorvo", "genre": "Historical Drama", "plot": "It is a movie in which Algerian revolutionaries fight for independence from French colonial rule.", "most_memorable_scene": "My favorite scene of the movie was when the Algerians march through the streets of Algiers singing the national anthem and waving their flags in celebration of their freedom."}, "Hachi: A Dog's Tale": {"main_actor": "Richard Gere", "director": "Lasse Hallström", "genre": "Drama", "plot": "It is a movie in which a man forms an unbreakable bond with a lost dog he takes in.", "most_memorable_scene": "My favorite scene of the movie was when Hachi waited for his owner at the train station every day until his death, despite the passing of time."}, "Pirates of the Caribbean: The Curse of the Black Pearl": {"main_actor": "Johnny Depp", "director": "Gore Verbinski", "genre": "Adventure_Fantasy", "plot": "It is a movie in which a blacksmith and a pirate embark on a quest to rescue the governor's daughter from cursed pirates.", "most_memorable_scene": "My favorite scene of the movie was when Captain Jack Sparrow and his crew escape the cursed pirates by sailing over the edge of the world."}, "Jai Bhim": {"main_actor": "Vikas Bhonsle", "director": "Anand Patwardhan", "genre": "Documentary", "plot": "It is a movie in which caste discrimination and inequality in India is explored through the life of a Dalit girl.", "most_memorable_scene": "My favorite scene of the movie was when Ambedkar, played by Prakash Jha, visits a village and addresses the people, inspiring them to stand up for their rights."}, "My Father and My Son": {"main_actor": "Mert Fırat", "director": "Fatih Akin", "genre": "Drama", "plot": "It is a movie in which a father and son attempt to reconnect after years of estrangement.", "most_memorable_scene": "My favorite scene of the movie was when the father and son found a way to communicate with each other through the window of the prison."}, "The Grapes of Wrath": {"main_actor": "Henry Fonda", "director": "John Ford", "genre": "Drama", "plot": "It is a movie in which a family of sharecroppers is forced to leave their home in Oklahoma and travel to California during the Great Depression.", "most_memorable_scene": "My favorite scene of the movie was when the Joad family finally arrives at the California border after a long and arduous journey."}, "Amores Perros": {"main_actor": "Gael García Bernal", "director": "Alejandro González Iñárritu", "genre": "Drama", "plot": "It is a movie in which three interconnected stories of love, family and dogfighting collide in Mexico City.", "most_memorable_scene": "My favorite scene of the movie was when Octavio, after being beaten up by thugs, jumps into a pit of wild dogs and is saved by Cofi."}, "Rebecca": {"main_actor": "Lily James", "director": "Ben Wheatley", "genre": "Mystery Thriller", "plot": "It is a movie in which a Jewish student moves to a small town in the American South and experiences a culture clash.", "most_memorable_scene": "My favorite scene of the movie was when Max and Mrs. Danvers talk in the moonlight on the terrace at Manderley."}, "Cool Hand Luke": {"main_actor": "Paul Newman", "director": "Stuart Rosenberg", "genre": "Drama", "plot": "It is a movie in which a man's quest for freedom is tested by an unrelenting prison system.", "most_memorable_scene": "My favorite scene of the movie was when Luke is in the middle of the road eating 50 eggs for a bet and the onlookers cheer him on."}, "The Handmaiden": {"main_actor": "Park Chan-wook", "director": "Park Chan-wook", "genre": "Thriller", "plot": "It is a movie in which a woman helps a pickpocket to swindle a wealthy heiress.", "most_memorable_scene": "My favorite scene of the movie was when Sook-Hee and Count Fujiwara were in the rain, and the Count finally realizes his love for her."}, "The 400 Blows": {"main_actor": "Jean-Pierre Léaud", "director": "Francois Truffaut", "genre": "Drama", "plot": "It is a movie in which a young boy struggles to find acceptance as he is neglected and mistreated by his parents and society.", "most_memorable_scene": "My favorite scene of the movie was when Antoine runs away from home, realizing that he will never be understood or appreciated by his parents."}, "The Sound of Music": {"main_actor": "Julie Andrews", "director": "Robert Wise", "genre": "Musical", "plot": "It is a movie in which a young woman joins a family of seven children to become their governess in Austria during the Nazi era.", "most_memorable_scene": "My favorite scene of the movie was when Maria and the von Trapp family sing together at the top of the mountain as a way to escape the Nazis."}, "It Happened One Night": {"main_actor": "Claudette Colbert", "director": "Frank Capra", "genre": "Romantic Comedy", "plot": "It is a movie in which a spoiled heiress and a roguish journalist cross paths on a night-long journey of adventure and romance.", "most_memorable_scene": "My favorite scene of the movie was when Clark Gable's character, Peter, and Claudette Colbert's character, Ellie, hitch a ride on a bus, and Peter teaches her how to hitchhike."}, "Persona": {"main_actor": "Kazunari Ninomiya", "director": "Ingmar Bergman", "genre": "Drama", "plot": "It is a movie in which a high school student discovers and unlocks a mysterious power to enter the collective unconscious.", "most_memorable_scene": "My favorite scene of the movie was when Elisabet Vogler and Alma are talking in the living room, and Alma notices that Elisabet is seemingly listening to her but not responding."}, "Life of Brian": {"main_actor": "John Cleese", "director": "Terry Jones", "genre": "Comedy", "plot": "It is a movie in which a man named Brian is mistaken for a messiah.", "most_memorable_scene": "My favorite scene of the movie was when Brian tells the crowd of people 'You've all got to work it out for yourselves!' and they all leave singing 'Always Look on the Bright Side of Life'."}, "Dersu Uzala": {"main_actor": "Maksim Munzuk", "director": "Akira Kurosawa", "genre": "Adventure_Drama", "plot": "It is a movie in which a Russian army explorer forms a bond with an indigenous hunter-gatherer in the 19th century.", "most_memorable_scene": "My favorite scene of the movie was when Dersu Uzala and the captain share a moment of understanding as Dersu talks about his connection to the land and his way of life."}, "The Iron Giant": {"main_actor": "Vin Diesel", "director": "Brad Bird", "genre": "Animation/Fantasy", "plot": "It is a movie in which a young boy forms an unlikely friendship with a giant robot from outer space.", "most_memorable_scene": "My favorite scene of the movie was the moment when the Iron Giant sacrificed himself to save the town."}, "The Help": {"main_actor": "Emma Stone", "director": "Tate Taylor", "genre": "Drama", "plot": "It is a movie in which a young white woman forms an unlikely bond with two black maids in 1960s Mississippi.", "most_memorable_scene": "My favorite scene of the movie was when Skeeter stands up for Aibileen in the ladies' room at the country club and tells off Hilly for putting a 'help wanted' ad in the paper."}, "Aladdin": {"main_actor": "Will Smith", "director": "Guy Ritchie", "genre": "Fantasy/Musical", "plot": "It is a movie in which a street urchin discovers a magical lamp containing a powerful genie.", "most_memorable_scene": "My favorite scene of the movie was when Aladdin and Princess Jasmine take a magical ride on the magic carpet, soaring high above the city of Agrabah."}, "Gandhi": {"main_actor": "Ben Kingsley", "director": "Richard Attenborough", "genre": "Biographical drama", "plot": "It is a movie in which an Indian lawyer leads his people to independence from the British Empire.", "most_memorable_scene": "My favorite scene of the movie was when Gandhi leads a peaceful march to the sea to make salt in defiance of the British-imposed salt tax."}, "Dances with Wolves": {"main_actor": "Kevin Costner", "director": "Kevin Costner", "genre": "Western", "plot": "It is a movie in which a soldier assigned to a remote outpost in the Dakotas befriends a tribe of Native Americans.", "most_memorable_scene": "My favorite scene of the movie was when John Dunbar and his new Native American friends were riding through the snow-covered plains, celebrating their newfound friendship."}}